import Testing

@testable import HeekeyCore

@Suite struct ReducerTests {
  @Test(arguments: [
    (
      [] as State,
      Action.기능(.backspace),
      ("", []) as (String, State)
    ),
    (
      [.자음(.ㄱ)],
      Action.기능(.backspace),
      ("", [])
    ),
    (
      [.자음(.ㄱ), .모음(.ㅏ)],
      Action.기능(.backspace),
      ("", [.자음(.ㄱ)])
    ),
    (
      [.자음(.ㄱ)],
      Action.완성문자("."),
      ("ㄱ.", [])
    ),
    (
      [.자음(.ㄱ), .모음(.ㅏ)],
      Action.완성문자("."),
      ("가.", [])
    ),
    (
      [.모음(.ㅏ)],
      Action.완성문자("."),
      ("ㅏ.", [])
    ),
    (
      [],
      Action.완성문자("."),
      (".", [])
    ),
    (
      [],
      Action.조합문자(.ㄱ),
      ("", [.자음(.ㄱ)])
    ),
    (
      [],
      Action.조합문자(.ㅏㅓ),
      ("", [.모음(.ㅏ)])
    ),
    (
      [.자음(.ㄱ)],
      Action.조합문자(.ㄱ),
      ("", [.자음(.ㄱ), .자음(.ㄱ)])
    ),
    (
      [.자음(.ㄱ)],
      Action.조합문자(.ㅏㅓ),
      ("", [.자음(.ㄱ), .모음(.ㅏ)])
    ),
    (
      [.자음(.ㄱ)],
      Action.기능(.쌍자음),
      ("", [.자음(.ㄱㄱ)])
    ),
    (
      [.자음(.ㄴ)],
      Action.기능(.쌍자음),
      ("", [.자음(.ㄴ)])
    ),
    (
      [.자음(.ㄱ)],
      Action.기능(.획추가),
      ("", [.자음(.ㅋ)])
    ),
    (
      [.자음(.ㅋ)],
      Action.기능(.획추가),
      ("", [.자음(.ㄱ)])
    ),
    (
      [.자음(.ㄹ)],
      Action.기능(.획추가),
      ("", [.자음(.ㄹ)])
    ),
    (
      [.모음(.ㅏ)],
      Action.조합문자(.ㅏㅓ),
      ("", [.모음(.ㅓ)])
    ),
    (
      [.모음(.ㅓ)],
      Action.조합문자(.ㅏㅓ),
      ("", [.모음(.ㅏ)])
    ),
    (
      [.모음(.ㅗ)],
      Action.조합문자(.ㅗㅜ),
      ("", [.모음(.ㅜ)])
    ),
    (
      [.모음(.ㅜ)],
      Action.조합문자(.ㅗㅜ),
      ("", [.모음(.ㅗ)])
    ),
    (
      [.모음(.ㅜ)],
      Action.조합문자(.ㅏㅓ),
      ("", [.모음(.ㅜ), .모음(.ㅓ)])
    ),
    (
      [.모음(.ㅗ)],
      Action.조합문자(.ㅏㅓ),
      ("", [.모음(.ㅗ), .모음(.ㅏ)])
    ),
    (
      [.모음(.ㅏ)],
      Action.기능(.쌍자음),
      ("", [.모음(.ㅏ)])
    ),
    (
      [.모음(.ㅏ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅑ)])
    ),
    (
      [.모음(.ㅑ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅑ)])
    ),
    (
      [.모음(.ㅓ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅕ)])
    ),
    (
      [.모음(.ㅗ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅛ)])
    ),
    (
      [.모음(.ㅜ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅠ)])
    ),
    (
      [.모음(.ㅡ)],
      Action.기능(.획추가),
      ("", [.모음(.ㅡ)])
    ),
  ]) func testReduce(arg: (State, Action, (String, State))) {
    let (prev, action, (expectedEmit, expectedNext)) = arg
    let (emit, next) = prev.dispatch(action: action)
    #expect(emit == expectedEmit)
    #expect(next == expectedNext)
  }
}
